# Pandas 10분 완성
- [링크](https://dataitgirls2.github.io/10minutes2pandas/)

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.047017  0.327864  1.734166  0.390207
2013-01-02 -0.617386  2.869124  0.484307 -1.628523
2013-01-03  0.366200  1.789332  0.867231 -2.740204
2013-01-04 -1.013629 -0.462705  0.411536 -0.387408
2013-01-05 -0.091825 -0.388284 -2.075517 -1.460817
2013-01-06 -0.092383  0.709533  1.349996  0.168778

In [7]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [8]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
df.tail(3)
df.tail()
df.head()

                   A         B         C         D
2013-01-01 -0.047017  0.327864  1.734166  0.390207
2013-01-02 -0.617386  2.869124  0.484307 -1.628523
2013-01-03  0.366200  1.789332  0.867231 -2.740204
2013-01-04 -1.013629 -0.462705  0.411536 -0.387408
2013-01-05 -0.091825 -0.388284 -2.075517 -1.460817

In [11]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.013629 -0.462705  0.411536 -0.387408
2013-01-05 -0.091825 -0.388284 -2.075517 -1.460817
2013-01-06 -0.092383  0.709533  1.349996  0.168778

In [12]:
df.sort_index(axis=1, ascending=False)
df.sort_values(by='B')

                   A         B         C         D
2013-01-04 -1.013629 -0.462705  0.411536 -0.387408
2013-01-05 -0.091825 -0.388284 -2.075517 -1.460817
2013-01-01 -0.047017  0.327864  1.734166  0.390207
2013-01-06 -0.092383  0.709533  1.349996  0.168778
2013-01-03  0.366200  1.789332  0.867231 -2.740204
2013-01-02 -0.617386  2.869124  0.484307 -1.628523

In [13]:
df['A']

2013-01-01   -0.047017
2013-01-02   -0.617386
2013-01-03    0.366200
2013-01-04   -1.013629
2013-01-05   -0.091825
2013-01-06   -0.092383
Freq: D, Name: A, dtype: float64

In [14]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.047017  0.327864  1.734166  0.390207
2013-01-02 -0.617386  2.869124  0.484307 -1.628523
2013-01-03  0.366200  1.789332  0.867231 -2.740204

In [15]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.617386  2.869124  0.484307 -1.628523
2013-01-03  0.366200  1.789332  0.867231 -2.740204
2013-01-04 -1.013629 -0.462705  0.411536 -0.387408

In [22]:
df.loc[dates[0]]

A   -0.047017
B    0.327864
C    1.734166
D    0.390207
Name: 2013-01-01 00:00:00, dtype: float64

In [23]:
# 행에서 전체를 가져오고
# 열에서 A, B 만 가져오시오.
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.047017  0.327864
2013-01-02 -0.617386  2.869124
2013-01-03  0.366200  1.789332
2013-01-04 -1.013629 -0.462705
2013-01-05 -0.091825 -0.388284
2013-01-06 -0.092383  0.709533

In [24]:
df.at[dates[0], 'A']

-0.04701709667867929

In [25]:
df[df.A>0]

                 A         B         C         D
2013-01-03  0.3662  1.789332  0.867231 -2.740204

In [31]:
df2 = df.copy()

In [32]:
df2

                   A         B         C         D
2013-01-01 -0.047017  0.327864  1.734166  0.390207
2013-01-02 -0.617386  2.869124  0.484307 -1.628523
2013-01-03  0.366200  1.789332  0.867231 -2.740204
2013-01-04 -1.013629 -0.462705  0.411536 -0.387408
2013-01-05 -0.091825 -0.388284 -2.075517 -1.460817
2013-01-06 -0.092383  0.709533  1.349996  0.168778

In [33]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
de2

                   A         B         C         D
2013-01-01 -0.047017  0.327864  1.734166  0.390207
2013-01-02 -0.617386  2.869124  0.484307 -1.628523
2013-01-03  0.366200  1.789332  0.867231 -2.740204
2013-01-04 -1.013629 -0.462705  0.411536 -0.387408
2013-01-05 -0.091825 -0.388284 -2.075517 -1.460817
2013-01-06 -0.092383  0.709533  1.349996  0.168778

In [34]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.366200  1.789332  0.867231 -2.740204   two
2013-01-05 -0.091825 -0.388284 -2.075517 -1.460817  four

In [35]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [39]:
# 프레임에다가. 시리즈를. 그냥. 추가해버린다.
df['F'] = s1

## 값 바꾸기
df.at[dates[0], 'A'] = 0

df.iat[0, 1] = 0

# D 열을 모두 5로 바꿔버리기
df.loc[:, 'D'] = np.array([5] * len(df))

In [37]:

df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.734166  5  NaN
2013-01-02 -0.617386  2.869124  0.484307  5  1.0
2013-01-03  0.366200  1.789332  0.867231  5  2.0
2013-01-04 -1.013629 -0.462705  0.411536  5  3.0
2013-01-05 -0.091825 -0.388284 -2.075517  5  4.0
2013-01-06 -0.092383  0.709533  1.349996  5  5.0

In [40]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [41]:
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000  1.734166  5  NaN NaN
2013-01-02 -0.617386  2.869124  0.484307  5  1.0 NaN
2013-01-03  0.366200  1.789332  0.867231  5  2.0 NaN
2013-01-04 -1.013629 -0.462705  0.411536  5  3.0 NaN

In [42]:
df1.loc[dates[0]:dates[1], 'E']=1

In [43]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.734166  5  NaN  1.0
2013-01-02 -0.617386  2.869124  0.484307  5  1.0  1.0
2013-01-03  0.366200  1.789332  0.867231  5  2.0  NaN
2013-01-04 -1.013629 -0.462705  0.411536  5  3.0  NaN

In [46]:
# 결측치가 하나라도 있으면 행을 삭제해버러랴ㅏ.
ddd = df1.dropna(how='any')

In [45]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.734166  5  NaN  1.0
2013-01-02 -0.617386  2.869124  0.484307  5  1.0  1.0
2013-01-03  0.366200  1.789332  0.867231  5  2.0  NaN
2013-01-04 -1.013629 -0.462705  0.411536  5  3.0  NaN

In [48]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.734166  5  5.0  1.0
2013-01-02 -0.617386  2.869124  0.484307  5  1.0  1.0
2013-01-03  0.366200  1.789332  0.867231  5  2.0  5.0
2013-01-04 -1.013629 -0.462705  0.411536  5  3.0  5.0

In [49]:
df.mean()

A   -0.241504
B    0.752833
C    0.461953
D    5.000000
F    3.000000
dtype: float64

In [50]:
df.mean(1)

2013-01-01    1.683542
2013-01-02    1.747209
2013-01-03    2.004553
2013-01-04    1.387040
2013-01-05    1.288875
2013-01-06    2.393429
Freq: D, dtype: float64

In [51]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.633800  0.789332 -0.132769  4.0  1.0
2013-01-04 -4.013629 -3.462705 -2.588464  2.0  0.0
2013-01-05 -5.091825 -5.388284 -7.075517  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [52]:
df.apply(np.cumsum)
df.apply(lambda x: x.max() - x.min())

A    1.379829
B    3.331829
C    3.809683
D    0.000000
F    4.000000
dtype: float64

In [53]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [54]:
s

0    4
1    3
2    6
3    1
4    6
5    2
6    4
7    2
8    3
9    6
dtype: int64

In [55]:
# 행으로 누산.
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  1.734166   5   NaN
2013-01-02 -0.617386  2.869124  2.218474  10   1.0
2013-01-03 -0.251186  4.658456  3.085704  15   3.0
2013-01-04 -1.264815  4.195751  3.497240  20   6.0
2013-01-05 -1.356640  3.807467  1.421723  25  10.0
2013-01-06 -1.449024  4.517000  2.771720  30  15.0

In [56]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.734166  5  NaN
2013-01-02 -0.617386  2.869124  0.484307  5  1.0
2013-01-03  0.366200  1.789332  0.867231  5  2.0
2013-01-04 -1.013629 -0.462705  0.411536  5  3.0
2013-01-05 -0.091825 -0.388284 -2.075517  5  4.0
2013-01-06 -0.092383  0.709533  1.349996  5  5.0

In [57]:
df.apply(lambda x: x.max() - x.min())

A    1.379829
B    3.331829
C    3.809683
D    0.000000
F    4.000000
dtype: float64

In [58]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [59]:
s

0    1
1    2
2    0
3    0
4    4
5    4
6    0
7    3
8    6
9    5
dtype: int64

In [60]:
s.value_counts()

0    3
4    2
1    1
2    1
3    1
6    1
5    1
dtype: int64

In [61]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [62]:
s.value_counts()

1    4
4    2
0    2
5    1
2    1
dtype: int64

In [63]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [65]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [66]:
df  = pd.DataFrame(np.random.randn(10,4))

In [67]:
df

          0         1         2         3
0 -0.605865 -0.181826 -0.984763  0.824219
1  0.134004  0.855064  0.540852 -0.834390
2 -0.063260  0.055890 -0.274347  0.928749
3 -0.784537  0.987735  1.649253 -1.134636
4  0.107136  1.252591  1.891103 -1.432370
5 -1.744272  1.417703  0.312468  0.146563
6 -0.629320  0.437562 -0.975171  0.404140
7  0.679156  0.472970  0.123414 -0.347452
8  1.862830 -2.191821 -1.299678  0.149670
9  0.965504 -0.132083  1.312778  0.759644

In [68]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]

In [69]:
pd.concat(pieces)

          0         1         2         3
0 -0.605865 -0.181826 -0.984763  0.824219
1  0.134004  0.855064  0.540852 -0.834390
2 -0.063260  0.055890 -0.274347  0.928749
3 -0.784537  0.987735  1.649253 -1.134636
4  0.107136  1.252591  1.891103 -1.432370
5 -1.744272  1.417703  0.312468  0.146563
6 -0.629320  0.437562 -0.975171  0.404140
7  0.679156  0.472970  0.123414 -0.347452
8  1.862830 -2.191821 -1.299678  0.149670
9  0.965504 -0.132083  1.312778  0.759644

In [70]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [71]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [72]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']